[
  {
    "id": 1,
    "title": "Redux Form",
    "subtitle": "Redux Form: uma simples alternativa para formulários com React+Redux",
    "content": "",
    "img": "https://blog.bia.pt/wp-content/uploads/2018/05/Captura-de-ecra%CC%83-2018-05-05-a%CC%80s-19.58.35.png"
  },
  {
    "id":2,
    "title":"Trabalho Remoto",
    "subtitle": "Trabalho remoto: um novo conceito, uma nova experiência",
    "content": "<p>Apesar de não ser um conceito muito comum e popular em Portugal, o trabalho remoto tem vindo a tornar-se numa realidade cada vez mais desejada tanto por profissionais, como por empresas que procuram contributos diferenciadores e novos métodos de trabalho. Porém, surgem muitas dúvidas relativamente às dificuldades e vantagens deste inovador método de trabalho na altura de investir e/ou iniciar um desafio profissional deste cariz.</p><p>Sendo ainda estudante com poucas horas presenciais, senti a necessidade de ocupar os meus tempos “livres” com uma experiência diferente. Ao mesmo tempo, gostava que esta experiência fosse benéfica para o meu currículo e experiência profissional. Contudo, encontrar uma oportunidade em concordância com os meus objetivos, não foi uma tarefa simples. (Tendo em conta a minha reduzida experiência profissional e o regime de horas reduzido necessário).</p><h4>Integração na <a href=\"https://bia.pt\" target=\"_blank\">bia.pt</a></h4><p>Felizmente, a <a href=\"https://bia.pt\" target=\"_blank\">bia.pt</a>, ofereceu-me a possibilidade de conciliar a minha atividade estudante, com um desafio profissional bastante enriquecedor. A integração numa equipa jovem, dinâmica e focada no fornecimento da melhor experiência possível, no universo de e-commerce online.</p><p>Fui recebido de forma bastante acolhedora, compreensiva e simpática, percebendo, desde o primeiro momento, os princípios e objetivos da <a href=\"https://bia.pt\" target=\"_blank\">bia.pt</a>. (fui até presenteado com um kit de boas vindas bastante original… Uma seleção de cervejas de diferentes países e uma camisola da <a href=\"https://bia.pt\" target=\"_blank\">bia.pt</a>!)</p><h4>Os desafios do trabalho remoto</h4><p>Contudo, considero que este ciclo inicial de adaptação é comum a qualquer tipo de regime de trabalho. (não apenas o remoto). Todas as equipas possuem métodos diferentes e visões que devem ser partilhadas com os seus respetivos novos membros. A adaptação à equipa revelou-se um desafio bastante simples de ultrapassar. (devido, claro, à boa disposição, vontade e disponibilidade de todos os elementos da equipa da <a href=\"https://bia.pt\" target=\"_blank\">bia.pt</a>).</p><h5>A gestão de tarefas</h5<<p>A gestão de tarefas e atribuição de responsabilidades é um dos grandes desafios de uma empresa que aposta em profissionais de trabalho remoto. Com o reduzido tempo de contacto, é importante estabelecer hábitos de trabalho competentes que satisfaçam ambos os intervenientes do processo.</p<<p>A atribuição de tarefas e feedback semanal fazem parte do conjunto de requisitos que considero fundamentais. A adopção de metodologias de trabalho são essenciais, na medida em que possibilitam o estabelecimento de um acompanhamento e monitorização regular de todo o trabalho que é realizado. Para além disso, permitem que a questão da eventual solidão ou isolamento do membro do membro, seja evitada.</p<<p>A comunicação diária e efetiva, (por ex.: num software de conversação em grupo), de todos os membros da equipa é fundamental e permite a partilha de ideias, de forma bastante simples e útil para a obtenção e definição de resultados coletivos.</p<<p>A utilização dos programas mais adequados à organização e gestão de equipas profissionais, de forma proficiente, é um factor bastante privilegiado pela <a href=\"https://bia.pt\" target=\"_blank\">bia.pt</a>. Só desta forma, é possível garantir toda a organização e competência de todos os elementos do grupo.</p<<h6>Tecnologias utilizadas pela <a href=\"https://bia.pt\" target=\"_blank\">bia.pt</a></h6<<ul<<li>Pivotal Tracker<a href=\"https://www.pivotaltracker.com\"> –&nbsp;&nbsp;<em>https://www.pivotaltracker.com</em></a><br<Através de uma lógica orientada à metodologia de trabalho àgil, o Pivotal Tracker permite realizar toda a monitorização e gestão de projetos, de forma bastante simples.</li<<li>Slack –<a href=\"https://slack.com/\">&nbsp;https://slack.com</a><br<Um software de comunicação entre equipas, capaz de agregar múltiplos serviços numa interface bastante simples e intuitiva.</li<<li>GitLab –&nbsp;<a href=\"https://about.gitlab.com\">https://about.gitlab.com</a><br<Software de controlo, revisão e partilha de código orientado numa lógica de <em>Continuous Integration</em>, que permite a equipas, através do uso da tecnologia Git, trabalhar, ao mesmo tempo em projetos ou tarefas simultaneamente.</li<<li>Zeplin –&nbsp;<a href=\"https://zeplin.io/\">https://zeplin.io</a><br<Ferramenta de colaboração, que permite a colaboração entre desenvolvedores e designers. Desta forma, muito orientada à lógica de&nbsp;trabalho remoto.</l<</u<<h5>A responsabilidade</h<<p>Enquanto trabalhador remoto, o factor que mais me preocupa, centra-se na capacidade de ser responsável e cumprir com os requisitos e normas aprovadas no momento em que é acordado um acordo prévio de trabalho.</<<p>O não cumprimento da totalidade das horas acordadas é muito fácil de ser desrespeitado, quando estamos a trabalhar em casa, na praia ou no café, com amigos. Pelo que considero que é fundamental adoptar um perfil responsável, consciente e sincero, enquanto trabalhador em regime remoto. Para além disso, deve existir sempre confiança partilhada por ambos os intervenientes do processo.</<<h5>A organização</h<<p>Apesar de muitos compararem, de certa forma, simétrica e proporcional a capacidade de organização com a habilidade de ser responsável, considero que a organização, é fundamental e deve ser vista como um dos factores essenciais, enquanto profissional (especialmente remoto).</<<p>A não existência de horários e controlo físico, pode tornar-se num desafio para perfis mais preguiçosos, ou menos interessados e aplicados. Desta forma, a organização do tempo de trabalho, o compromisso com a atividade e a&nbsp;privilegiação dos objetivos são princípios primordiais e indispensáveis.</<<h5>O acompanhamento e formação contínua</h<<p>Um dos factores que mais me tem surpreendido ao longo desta minha experiência, centra-se no nível de preocupação e importância que a equipa da <a href=\"https://bia.pt\" target=\"_blank\">bia.pt</a> tem vindo a mostrar com o meu próprio perfil e competências.</<<p>Tenho apreendido e desenvolvido bastantes competências, graças ao contínuo aconselhamento e formação disponibilizado pelos meus colegas, contrariando, por outro lado, todas as minhas anteriores expectativas: a simples realização de tarefas, sem qualquer tipo de aconselhamento e acompanhamento.</<<h5>O gosto pelo que se faz</h<<p>Finalmente, não podia deixar de referenciar o ponto, que considero, mais importante. É essencial que o profissional tenha gosto e interesse pela atividade que exerce. Nunca seremos bons profissionais, se não gostarmos de perder tempo a trabalhar, a exercer as funções, e sobretudo, a aprender.</<<p>Portanto, se gostas do que fazes e tens oportunidade de te desafiar a ti mesmo/a remotamente, não tenhas medo. Aproveita, aprende e partilha os teus conhecimentos! Lembra-te que o trabalho remoto é um processo recíproco: ambos os intervenientes são responsáveis. Só dessa forma,&nbsp; é possível alcançar todos os resultados esperados!</p><p>Obrigado <a href=\"https://bia.pt\" target=\"_blank\">bia.pt</a>.</p><h3></h3><p>&nbsp;</p>\"<p>Depois de feitas as apresentações, a vontade e motivação de contribuir com o projeto revelou-se, progressivamente, cada vez superior.&nbsp; Foram surgindo vários desafios, relacionados essencialmente com a aquisição dos métodos de trabalho e de comunicação na equipa.</p>",
    "img": "https://blog.bia.pt/wp-content/uploads/2018/04/RemoteMountain.jpg"
    }
  ]